adbik4/embedded-vehicle-telemetry/STM32U3C5.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="AES">
      <name>SEC_AES</name>
      <baseAddress>0x520C0000</baseAddress>
    </peripheral>
    <peripheral>
      <name>CCB</name>
      <description>CCB register block</description>
      <groupName>CCB</groupName>
      <baseAddress>0x420C7C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CCB_CR</name>
          <displayName>CCB_CR</displayName>
          <description>CCB control register</description>
          <addressOffset>0x000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CCOP</name>
              <description>Coupling and chaining operation
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x044</name>
                  <description>Modular exponentiation blob creation with priv key from the CPU</description>
                  <value>0x044</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x045</name>
                  <description>Modular exponentiation blob use</description>
                  <value>0x045</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x080</name>
                  <description>ECC scalar multiplication blob creation with priv key from the CPU</description>
                  <value>0x080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x082</name>
                  <description>ECC scalar multiplication blob creation with priv key from the RNG</description>
                  <value>0x082</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x081</name>
                  <description>ECC scalar multiplication blob use, or ECDSA signature blob use for public key computation</description>
                  <value>0x081</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x0C0</name>
                  <description>ECDSA signature blob creation with priv key from the CPU</description>
                  <value>0x0C0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x0C2</name>
                  <description>ECDSA signature blob creation with priv key from the RNG</description>
                  <value>0x0C2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x0C3</name>
                  <description>ECDSA signature blob use for ECDSA signature</description>
                  <value>0x0C3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPRST</name>
              <description>CCB reset
</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCB_SR</name>
          <displayName>CCB_SR</displayName>
          <description>CCB status register</description>
          <addressOffset>0x004</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OPSTEP</name>
              <description>Operation step
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OPERR</name>
              <description>Operation error
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>No error detected during protected PKA operation (if applicable)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>CCB RCC reset has been detected when OPSTEP &gt; 0x0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>SAES RCC reset has been detected when OPSTEP &gt; 0x0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>PKA RCC reset has been detected when OPSTEP &gt; 0x0</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x4</name>
                  <description>RNG RCC reset has been detected when OPSTEP &gt; 0x0</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x5</name>
                  <description>The RCC has gated the CCB clock when OPSTEP &gt; 0x0</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x6</name>
                  <description>The RCC has gated the SAES clock when OPSTEP &gt; 0x0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x7</name>
                  <description>The RCC has gated the PKA clock when OPSTEP &gt; 0x0</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x8</name>
                  <description>The RCC has gated the RNG clock when OPSTEP &gt; 0x0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x9</name>
                  <description>Random in SAES_IV1 is trivial (all 0s or all 1s) when OPSTEP = 0x2</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xA</name>
                  <description>Random in SAES_IV2 is trivial (all 0s or all 1s) when OPSTEP = 0x2</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xB</name>
                  <description>Random in SAES_IV3 is trivial (all 0s or all 1s) when OPSTEP = 0x2</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xC</name>
                  <description>When OPSTEP = 0x17 SAES GCM TAG comparison with CCB_REFTAG failed, or a register different from SAES_DOUT was read in the SAES.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xD</name>
                  <description>KEYSIZE  different  256 bits in SAES_CR when the SAES is enabled, and OPSTEP &gt; 0x0.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xE</name>
                  <description>CHMOD  different  GCM in SAES_CR when 0x1 less than OPSTEP less than 0x18, or the SAES is not enabled, or KEYVALID is cleared when GCMPH &gt; 0x0.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xF</name>
                  <description>KMOD different from wrapped key mode in SAES_CR when the SAES is enabled, and</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x10</name>
                  <description>KEYSEL  different  0x1 or 0x4 in SAES_CR when the SAES is enabled, KEYVALID is set, and OPSTEP=0x1.</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x11</name>
                  <description>GCMPH not correct (not incremented) in SAES_CR when OPSTEP &gt; 0x1.</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x12</name>
                  <description>MODE in SAES_CR does not match the expected value (selected by CCOP in CCB_CR) when OPSTEP &gt; 0x1.</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x13</name>
                  <description>BUSY = 1 in SAES_SR when OPSTEP= 0x18 or 0x19.</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x14</name>
                  <description>EN = 0 in PKA_CR when OPSTEP &gt; 0x2 (except 0x12).</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x15</name>
                  <description>INITOK = 0 in PKA_SR when OPSTEP &gt; 0x2 (except 0x12).</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x16</name>
                  <description>Authorized by local firewall, but unexpected AHB error detected when OPSTEP &gt; 0x0.</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x18</name>
                  <description>CCB_REFTAGRx registers are equal to 0 when OPSTEP &gt; 0x12.</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1A</name>
                  <description>Security or/and privilege protection inconsistent (see Section5: Global TrustZone controller (GTZC)) for the peripherals SAES, PKA, RNG, and CCB when OPSTEP &gt; 0x0.</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1B</name>
                  <description>MODE in PKA_CR does not match the expected value (selected by CCOP in CCB_CR) when OPSTEP &gt; 0x0.</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1C</name>
                  <description>OPSTEP end-step event not found at OPSTEP= 0x0 (SAES KEYVALID is set).</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1D</name>
                  <description>OPSTEP end-step event not found at OPSTEP = 0x1.</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1E</name>
                  <description>OPSTEP end-step event not found at OPSTEP = 0x2.</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1F</name>
                  <description>OPSTEP end-step event not found at OPSTEP = 0x3.</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x20</name>
                  <description>OPSTEP end-step event not found at OPSTEP = 0xA.</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x21</name>
                  <description>OPSTEP end-step event not found at OPSTEP = 0x12.</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x22</name>
                  <description>OPSTEP end-step event not found at OPSTEP = 0x13.</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x23</name>
                  <description>OPSTEP end-step event not found at OPSTEP = 0x17.</description>
                  <value>0x23</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCB_BUSY</name>
              <description>CCB busy
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>CCB idle</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>CCB busy or PKA RAM is being cleared following a peripheral reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAMP_EVT0</name>
              <description>Tamper i flag
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>No event</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Tamper event i has been raised.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAMP_EVT1</name>
              <description>Tamper i flag
</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>No event</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Tamper event i has been raised.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAMP_EVT2</name>
              <description>Tamper i flag
</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>No event</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Tamper event i has been raised.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAMP_EVT3</name>
              <description>Tamper i flag
</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>No event</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Tamper event i has been raised.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAMP_EVT4</name>
              <description>Tamper i flag
</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>No event</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Tamper event i has been raised.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAMP_EVT5</name>
              <description>Tamper i flag
</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>No event</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Tamper event i has been raised.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
