adbik4/embedded-vehicle-telemetry/STM32U3C5.svd
        <register>
          <name>EXTI_EXTICR1</name>
          <displayName>EXTI_EXTICR1</displayName>
          <description>EXTI external interrupt selection register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXTI0</name>
              <description>EXTI0 GPIO port selection
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>PA[0] pin</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x01</name>
                  <description>PB[0] pin</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x02</name>
                  <description>PC[0] pin</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x03</name>
                  <description>PD[0] pin</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x04</name>
                  <description>PE[0] pin</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x05</name>
                  <description>PF[0] pin</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x06</name>
                  <description>PG[0] pin</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x07</name>
                  <description>PH[0] pin</description>
                  <value>0x07</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTI1</name>
              <description>EXTI1 GPIO port selection
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>PA[1] pin</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x01</name>
                  <description>PB[1] pin</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x02</name>
                  <description>PC[1] pin</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x03</name>
                  <description>PD[1] pin</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x04</name>
                  <description>PE[1] pin</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x05</name>
                  <description>PF[1] pin</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x06</name>
                  <description>PG[1] pin</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x07</name>
                  <description>PH[1] pin</description>
                  <value>0x07</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTI2</name>
              <description>EXTI2 GPIO port selection
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>PA[2] pin</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x01</name>
                  <description>PB[2] pin</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x02</name>
                  <description>PC[2] pin</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x03</name>
                  <description>PD[2] pin</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x04</name>
                  <description>PE[2] pin</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x05</name>
                  <description>PF[2] pin</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x06</name>
                  <description>PG[2] pin</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x07</name>
                  <description>PH[2] pin</description>
                  <value>0x07</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTI3</name>
              <description>EXTI3 GPIO port selection
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>PA[3] pin</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x01</name>
                  <description>PB[3] pin</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x02</name>
                  <description>PC[3] pin</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x03</name>
                  <description>PD[3] pin</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x04</name>
                  <description>PE[3] pin</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x05</name>
                  <description>PF[3] pin</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x06</name>
                  <description>PG[3] pin</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x07</name>
                  <description>PH[3] pin</description>
                  <value>0x07</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI_EXTICR2</name>
          <displayName>EXTI_EXTICR2</displayName>
          <description>EXTI external interrupt selection register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXTI4</name>
              <description>EXTI4 GPIO port selection
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>PA[4] pin</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x01</name>
                  <description>PB[4] pin</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x02</name>
                  <description>PC[4] pin</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x03</name>
                  <description>PD[4] pin</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x04</name>
                  <description>PE[4] pin</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x05</name>
                  <description>PF[4] pin</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x06</name>
                  <description>PG[4] pin</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x07</name>
                  <description>PH[4] pin</description>
                  <value>0x07</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTI5</name>
              <description>EXTI5 GPIO port selection
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>PA[5] pin</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x01</name>
                  <description>PB[5] pin</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x02</name>
                  <description>PC[5] pin</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x03</name>
                  <description>PD[5] pin</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x04</name>
                  <description>PE[5] pin</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x05</name>
                  <description>PF[5] pin</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x06</name>
                  <description>PG[5] pin</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x07</name>
                  <description>PH[5] pin</description>
                  <value>0x07</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTI6</name>
              <description>EXTI6 GPIO port selection
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>PA[6] pin</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x01</name>
                  <description>PB[6] pin</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x02</name>
                  <description>PC[6] pin</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x03</name>
                  <description>PD[6] pin</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x04</name>
                  <description>PE[6] pin</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x05</name>
                  <description>PF[6] pin</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x06</name>
                  <description>PG[6] pin</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x07</name>
                  <description>PH[6] pin</description>
                  <value>0x07</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTI7</name>
              <description>EXTI7 GPIO port selection
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>PA[7] pin</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x01</name>
                  <description>PB[7] pin</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x02</name>
                  <description>PC[7] pin</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x03</name>
                  <description>PD[7] pin</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x04</name>
                  <description>PE[7] pin</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x05</name>
                  <description>PF[7] pin</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x06</name>
                  <description>PG[7] pin</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x07</name>
                  <description>PH[7] pin</description>
                  <value>0x07</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
