adbik4/embedded-vehicle-telemetry/STM32U3C5.svd
		<register>
		  <name>GTZC1_TZSC_PRIVCFGR1</name>
		  <displayName>GTZC1_TZSC_PRIVCFGR1</displayName>
		  <description>GTZC1 TZSC privilege configuration register 1</description>
		  <addressOffset>0x020</addressOffset>
		  <size>0x20</size>
		  <access>read-write</access>
		  <resetValue>0x00000000</resetValue>
		  <resetMask>0xFFFFFFFF</resetMask>
		  <fields>
			<field>
			  <name>TIM2PRIV</name>
			  <description>Privileged access mode for TIM2</description>
			  <bitOffset>0</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>TIM3PRIV</name>
			  <description>Privileged access mode for TIM3</description>
			  <bitOffset>1</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>TIM4PRIV</name>
			  <description>Privileged access mode for TIM4</description>
			  <bitOffset>2</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>TIM6PRIV</name>
			  <description>Privileged access mode for TIM6</description>
			  <bitOffset>4</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>TIM7PRIV</name>
			  <description>Privileged access mode for TIM7</description>
			  <bitOffset>5</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>WWDGPRIV</name>
			  <description>Privileged access mode for WWDG</description>
			  <bitOffset>6</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>IWDGPRIV</name>
			  <description>Privileged access mode for IWDG</description>
			  <bitOffset>7</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>SPI2PRIV</name>
			  <description>Privileged access mode for SPI2</description>
			  <bitOffset>8</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>USART2PRIV</name>
			  <description>Privileged access mode for USART2
	</description>
			  <bitOffset>9</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>USART3PRIV</name>
			  <description>Privileged access mode for USART3
	</description>
			  <bitOffset>10</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>UART4PRIV</name>
			  <description>Privileged access mode for UART4</description>
			  <bitOffset>11</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>UART5PRIV</name>
			  <description>Privileged access mode for UART5</description>
			  <bitOffset>12</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>I2C1PRIV</name>
			  <description>Privileged access mode for I2C1</description>
			  <bitOffset>13</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>I2C2PRIV</name>
			  <description>Privileged access mode for I2C2</description>
			  <bitOffset>14</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>CRSPRIV</name>
			  <description>Privileged access mode for CRS</description>
			  <bitOffset>15</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>I2C4PRIV</name>
			  <description>Privileged access mode for I2C4
	</description>
			  <bitOffset>16</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>LPTIM2PRIV</name>
			  <description>Privileged access mode for LPTIM2</description>
			  <bitOffset>17</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>FDCAN1PRIV</name>
			  <description>Privileged access mode for FDCAN1
	</description>
			  <bitOffset>18</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>FDCAN2PRIV</name>
			  <description>Privileged access mode for FDCAN2
	</description>
			  <bitOffset>20</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>SPI3PRIV</name>
			  <description>Privileged access mode for SPI3</description>
			  <bitOffset>21</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>I3C1PRIV</name>
			  <description>Privileged access mode for I3C1</description>
			  <bitOffset>22</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>OPAMPPRIV</name>
			  <description>Privileged access mode for OPAMP</description>
			  <bitOffset>23</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>VREFBUFPRIV</name>
			  <description>Privileged access mode for VREFBUF</description>
			  <bitOffset>24</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>SPI4PRIV</name>
			  <description>Privileged access mode for SPI4
	</description>
			  <bitOffset>25</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
		  </fields>
		</register>
		<register>
		  <name>GTZC1_TZSC_PRIVCFGR2</name>
		  <displayName>GTZC1_TZSC_PRIVCFGR2</displayName>
		  <description>GTZC1 TZSC privilege configuration register 2</description>
		  <addressOffset>0x024</addressOffset>
		  <size>0x20</size>
		  <access>read-write</access>
		  <resetValue>0x00000000</resetValue>
		  <resetMask>0xFFFFFFFF</resetMask>
		  <fields>
			<field>
			  <name>TIM1PRIV</name>
			  <description>Privileged access mode for TIM1</description>
			  <bitOffset>0</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>SPI1PRIV</name>
			  <description>Privileged access mode for SPI1</description>
			  <bitOffset>1</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>TIM8PRIV</name>
			  <description>Privileged access mode for TIM8
	</description>
			  <bitOffset>2</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>USART1PRIV</name>
			  <description>Privileged access mode for USART1</description>
			  <bitOffset>3</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>TIM15PRIV</name>
			  <description>Privileged access mode for TIM15</description>
			  <bitOffset>4</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>TIM16PRIV</name>
			  <description>Privileged access mode for TIM16</description>
			  <bitOffset>5</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>TIM17PRIV</name>
			  <description>Privileged access mode for TIM17</description>
			  <bitOffset>6</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>SAI1PRIV</name>
			  <description>Privileged access mode for SAI1</description>
			  <bitOffset>7</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>TIM12PRIV</name>
			  <description>Privileged access mode for TIM12
	</description>
			  <bitOffset>8</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>USBPRIV</name>
			  <description>Privileged access mode for USB</description>
			  <bitOffset>9</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>I3C2PRIV</name>
			  <description>Privileged access mode for I3C2</description>
			  <bitOffset>10</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>LPUART1PRIV</name>
			  <description>Privileged access mode for LPUART1</description>
			  <bitOffset>11</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>I2C3PRIV</name>
			  <description>Privileged access mode for I2C3</description>
			  <bitOffset>12</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>LPTIM1PRIV</name>
			  <description>Privileged access mode for LPTIM1</description>
			  <bitOffset>13</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>LPTIM3PRIV</name>
			  <description>Privileged access mode for LPTIM3</description>
			  <bitOffset>14</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>LPTIM4PRIV</name>
			  <description>Privileged access mode for LPTIM4</description>
			  <bitOffset>15</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>COMPPRIV</name>
			  <description>Privileged access mode for COMP</description>
			  <bitOffset>16</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
		  </fields>
		</register>
