adbik4/embedded-vehicle-telemetry/STM32U3C5.svd
		<register>
		  <name>GTZC1_TZSC_PRIVCFGR3</name>
		  <displayName>GTZC1_TZSC_PRIVCFGR3</displayName>
		  <description>GTZC1 TZSC privilege configuration register 3</description>
		  <addressOffset>0x0028</addressOffset>
		  <size>0x20</size>
		  <access>read-write</access>
		  <resetValue>0x00000000</resetValue>
		  <resetMask>0xFFFFFFFF</resetMask>
		  <fields>
			<field>
			  <name>CRCPRIV</name>
			  <description>Privileged access mode for CRC</description>
			  <bitOffset>3</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>TSCPRIV</name>
			  <description>Privileged access mode for TSC</description>
			  <bitOffset>4</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>ICACHE_REGPRIV</name>
			  <description>Privileged access mode for ICACHE registers</description>
			  <bitOffset>6</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>ADC12PRIV</name>
			  <description>Privileged access mode for ADC1 and ADC2</description>
			  <bitOffset>8</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>AESPRIV</name>
			  <description>Privileged access mode for AES</description>
			  <bitOffset>11</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>HASHPRIV</name>
			  <description>Privileged access mode for HASH</description>
			  <bitOffset>12</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>RNGPRIV</name>
			  <description>Privileged access mode for RNG</description>
			  <bitOffset>13</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>PKAPRIV</name>
			  <description>Privileged access mode for PKA</description>
			  <bitOffset>14</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>SAESPRIV</name>
			  <description>Privileged access mode for SAES</description>
			  <bitOffset>15</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>CCBPRIV</name>
			  <description>Privileged access mode for CCB</description>
			  <bitOffset>16</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>SDMMC1PRIV</name>
			  <description>Privileged access mode for SDMMC1</description>
			  <bitOffset>17</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>OCTOSPI1_REGPRIV</name>
			  <description>Privileged access mode for OCTOSPI1 registers</description>
			  <bitOffset>20</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>RAMCFGPRIV</name>
			  <description>Privileged access mode for RAMCFG</description>
			  <bitOffset>22</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>DAC1PRIV</name>
			  <description>Privileged access mode for DAC1</description>
			  <bitOffset>23</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>ADF1PRIV</name>
			  <description>Privileged access mode for ADF1</description>
			  <bitOffset>24</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>HSP1PRIV</name>
			  <description>Privileged access mode for HSP1
	</description>
			  <bitOffset>29</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Unprivileged</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Privileged</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
		  </fields>
		</register>
