adbik4/embedded-vehicle-telemetry/STM32U3C5.svd
	  </registers>
    </peripheral>
    <peripheral derivedFrom="GTZC1_TZSC">
      <name>SEC_GTZC1_TZSC</name>
      <baseAddress>0x50032400</baseAddress>
    </peripheral>
    <peripheral>
      <name>GTZC1_TZIC</name>
      <description>GTZC1_TZIC address block description</description>
      <groupName>GTZC1</groupName>
      <baseAddress>0x40032800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x250</size>
        <usage>registers</usage>
      </addressBlock>
	  <registers>
		<register>
		  <name>GTZC1_TZIC_IER1</name>
		  <displayName>GTZC1_TZIC_IER1</displayName>
		  <description>GTZC1 TZIC interrupt enable register 1</description>
		  <alternateRegister>GTZC1_TZSC_CR</alternateRegister>
		  <addressOffset>0x000</addressOffset>
		  <size>0x20</size>
		  <access>read-write</access>
		  <resetValue>0x00000000</resetValue>
		  <resetMask>0xFFFFFFFF</resetMask>
		  <fields>
			<field>
			  <name>TIM2IE</name>
			  <description>Illegal access interrupt enable for TIM2</description>
			  <bitOffset>0</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Interrupt disabled</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Interrupt enabled</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>TIM3IE</name>
			  <description>Illegal access interrupt enable for TIM3</description>
			  <bitOffset>1</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Interrupt disabled</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Interrupt enabled</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>TIM4IE</name>
			  <description>Illegal access interrupt enable for TIM4</description>
			  <bitOffset>2</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Interrupt disabled</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Interrupt enabled</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>TIM6IE</name>
			  <description>Illegal access interrupt enable for TIM6</description>
			  <bitOffset>4</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Interrupt disabled</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Interrupt enabled</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>TIM7IE</name>
			  <description>Illegal access interrupt enable for TIM7</description>
			  <bitOffset>5</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Interrupt disabled</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Interrupt enabled</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>WWDGIE</name>
			  <description>Illegal access interrupt enable for WWDG</description>
			  <bitOffset>6</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Interrupt disabled</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Interrupt enabled</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>IWDGIE</name>
			  <description>Illegal access interrupt enable for IWDG</description>
			  <bitOffset>7</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Interrupt disabled</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Interrupt enabled</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>SPI2IE</name>
			  <description>Illegal access interrupt enable for SPI2</description>
			  <bitOffset>8</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Interrupt disabled</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Interrupt enabled</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>USART2IE</name>
			  <description>Illegal access interrupt enable for USART2
	</description>
			  <bitOffset>9</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Interrupt disabled</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Interrupt enabled</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>USART3IE</name>
			  <description>Illegal access interrupt enable for USART3</description>
			  <bitOffset>10</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Interrupt disabled</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Interrupt enabled</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>UART4IE</name>
			  <description>Illegal access interrupt enable for UART4</description>
			  <bitOffset>11</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Interrupt disabled</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Interrupt enabled</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>UART5IE</name>
			  <description>Illegal access interrupt enable for UART5</description>
			  <bitOffset>12</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Interrupt disabled</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Interrupt enabled</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>I2C1IE</name>
			  <description>Illegal access interrupt enable for I2C1</description>
			  <bitOffset>13</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Interrupt disabled</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Interrupt enabled</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>I2C2IE</name>
			  <description>Illegal access interrupt enable for I2C2</description>
			  <bitOffset>14</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Interrupt disabled</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Interrupt enabled</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>CRSIE</name>
			  <description>Illegal access interrupt enable for CRS</description>
			  <bitOffset>15</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Interrupt disabled</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Interrupt enabled</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>I2C4IE</name>
			  <description>Illegal access interrupt enable for I2C4
	</description>
			  <bitOffset>16</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Interrupt disabled</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Interrupt enabled</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>LPTIM2IE</name>
			  <description>Illegal access interrupt enable for LPTIM2</description>
			  <bitOffset>17</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Interrupt disabled</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Interrupt enabled</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>FDCAN1IE</name>
			  <description>Illegal access interrupt enable for FDCAN1 and FDCAN SRAM</description>
			  <bitOffset>18</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Interrupt disabled</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Interrupt enabled</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>FDCAN2IE</name>
			  <description>Illegal access interrupt enable for FDCAN2
	</description>
			  <bitOffset>20</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Interrupt disabled</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Interrupt enabled</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>SPI3IE</name>
			  <description>Illegal access interrupt enable for SPI3</description>
			  <bitOffset>21</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Interrupt disabled</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Interrupt enabled</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>I3C1IE</name>
			  <description>Illegal access interrupt enable for I3C1</description>
			  <bitOffset>22</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Interrupt disabled</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Interrupt enabled</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>OPAMPIE</name>
			  <description>Illegal access interrupt enable for OPAMP</description>
			  <bitOffset>23</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Interrupt disabled</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Interrupt enabled</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>VREFBUFIE</name>
			  <description>Illegal access interrupt enable for VREFBUF</description>
			  <bitOffset>24</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Interrupt disabled</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Interrupt enabled</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>SPI4IE</name>
			  <description>Illegal access interrupt enable for SPI4
	</description>
			  <bitOffset>25</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>Interrupt disabled</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Interrupt enabled</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
		  </fields>
		</register>
