adbik4/embedded-vehicle-telemetry/STM32U3C5.svd
		<register>
		  <name>GTZC1_TZIC_SR1</name>
		  <displayName>GTZC1_TZIC_SR1</displayName>
		  <description>GTZC1 TZIC status register 1</description>
		  <alternateRegister>GTZC1_TZSC_SECCFGR1</alternateRegister>
		  <addressOffset>0x010</addressOffset>
		  <size>0x20</size>
		  <access>read-write</access>
		  <resetValue>0x00000000</resetValue>
		  <resetMask>0xFFFFFFFF</resetMask>
		  <fields>
			<field>
			  <name>TIM2F</name>
			  <description>Illegal access flag for TIM2</description>
			  <bitOffset>0</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>TIM3F</name>
			  <description>Illegal access flag for TIM3</description>
			  <bitOffset>1</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>TIM4F</name>
			  <description>Illegal access flag for TIM4</description>
			  <bitOffset>2</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>TIM6F</name>
			  <description>Illegal access flag for TIM6</description>
			  <bitOffset>4</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>TIM7F</name>
			  <description>Illegal access flag for TIM7</description>
			  <bitOffset>5</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>WWDGF</name>
			  <description>Illegal access flag for WWDG</description>
			  <bitOffset>6</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>IWDGF</name>
			  <description>Illegal access flag for IWDG</description>
			  <bitOffset>7</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>SPI2F</name>
			  <description>Illegal access flag for SPI2</description>
			  <bitOffset>8</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>USART2F</name>
			  <description>Illegal access flag for USART2
	</description>
			  <bitOffset>9</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>USART3F</name>
			  <description>Illegal access flag for USART3</description>
			  <bitOffset>10</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>UART4F</name>
			  <description>Illegal access flag for UART4</description>
			  <bitOffset>11</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>UART5F</name>
			  <description>Illegal access flag for UART5</description>
			  <bitOffset>12</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>I2C1F</name>
			  <description>Illegal access flag for I2C1</description>
			  <bitOffset>13</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>I2C2F</name>
			  <description>Illegal access flag for I2C2</description>
			  <bitOffset>14</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>CRSF</name>
			  <description>Illegal access flag for CRS</description>
			  <bitOffset>15</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>I2C4F</name>
			  <description>Illegal access flag for I2C4
	</description>
			  <bitOffset>16</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>LPTIM2F</name>
			  <description>Illegal access flag for LPTIM2</description>
			  <bitOffset>17</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>FDCAN1F</name>
			  <description>Illegal access flag for FDCAN1 and FDCAN SRAM</description>
			  <bitOffset>18</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>FDCAN2F</name>
			  <description>Illegal access flag for FDCAN2
	</description>
			  <bitOffset>20</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>SPI3F</name>
			  <description>Illegal access flag for SPI3</description>
			  <bitOffset>21</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>I3C1F</name>
			  <description>Illegal access flag for I3C1</description>
			  <bitOffset>22</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>OPAMPF</name>
			  <description>Illegal access flag for OPAMP</description>
			  <bitOffset>23</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>VREFBUFF</name>
			  <description>Illegal access flag for VREFBUF</description>
			  <bitOffset>24</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>SPI4F</name>
			  <description>Illegal access flag for SPI4
	</description>
			  <bitOffset>25</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
		  </fields>
		</register>
		<register>
		  <name>GTZC1_TZIC_SR2</name>
		  <displayName>GTZC1_TZIC_SR2</displayName>
		  <description>GTZC1 TZIC status register 2</description>
		  <alternateRegister>GTZC1_TZSC_SECCFGR2</alternateRegister>
		  <addressOffset>0x014</addressOffset>
		  <size>0x20</size>
		  <access>read-write</access>
		  <resetValue>0x00000000</resetValue>
		  <resetMask>0xFFFFFFFF</resetMask>
		  <fields>
			<field>
			  <name>TIM1F</name>
			  <description>Illegal access flag for TIM1</description>
			  <bitOffset>0</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>SPI1F</name>
			  <description>Illegal access flag for SPI1</description>
			  <bitOffset>1</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>TIM8F</name>
			  <description>Illegal access flag for TIM8
	</description>
			  <bitOffset>2</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>USART1F</name>
			  <description>Illegal access flag for USART1</description>
			  <bitOffset>3</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>TIM15F</name>
			  <description>Illegal access flag for TIM15</description>
			  <bitOffset>4</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>TIM16F</name>
			  <description>Illegal access flag for TIM16</description>
			  <bitOffset>5</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>TIM17F</name>
			  <description>Illegal access flag for TIM17</description>
			  <bitOffset>6</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>SAI1F</name>
			  <description>Illegal access flag for SAI1</description>
			  <bitOffset>7</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>TIM12F</name>
			  <description>Illegal access flag for TIM12
	</description>
			  <bitOffset>8</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>USBF</name>
			  <description>Illegal access flag for USB</description>
			  <bitOffset>9</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>I3C2F</name>
			  <description>Illegal access flag for I3C2</description>
			  <bitOffset>10</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>LPUART1F</name>
			  <description>Illegal access flag for LPUART1</description>
			  <bitOffset>11</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>I2C3F</name>
			  <description>Illegal access flag for I2C3</description>
			  <bitOffset>12</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>LPTIM1F</name>
			  <description>Illegal access flag for LPTIM1</description>
			  <bitOffset>13</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>LPTIM3F</name>
			  <description>Illegal access flag for LPTIM3</description>
			  <bitOffset>14</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>LPTIM4F</name>
			  <description>Illegal access flag for LPTIM4</description>
			  <bitOffset>15</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
			<field>
			  <name>COMPF</name>
			  <description>Illegal access flag for COMP</description>
			  <bitOffset>16</bitOffset>
			  <bitWidth>1</bitWidth>
			  <access>read-write</access>
			  <enumeratedValues>
				<enumeratedValue>
				  <name>B_0x0</name>
				  <description>No illegal access event</description>
				  <value>0x0</value>
				</enumeratedValue>
				<enumeratedValue>
				  <name>B_0x1</name>
				  <description>Illegal access event</description>
				  <value>0x1</value>
				</enumeratedValue>
			  </enumeratedValues>
			</field>
		  </fields>
		</register>
