adbik4/embedded-vehicle-telemetry/STM32U3C5.svd
        <register>
          <name>I3C_EVR</name>
          <displayName>I3C_EVR</displayName>
          <description>I3C event register</description>
          <addressOffset>0x050</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000003</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFEF</name>
              <description>C-FIFO empty flag (whatever the I3C acts as controller)
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TxFEF</name>
              <description>Tx-FIFO empty flag (whatever the I3C acts as controller/target)
</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFNFF</name>
              <description>C-FIFO not full flag (when the I3C acts as controller)
</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SFNEF</name>
              <description>S-FIFO not empty flag (when the I3C acts as controller)
</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TxFNFF</name>
              <description>Tx-FIFO not full flag (whatever the I3C acts as controller/target)
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RxFNEF</name>
              <description>Rx-FIFO not empty flag (whatever the I3C acts as controller/target)
</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TxLASTF</name>
              <description>Last written data byte/word flag (whatever the I3C acts as controller/target)
</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RxLASTF</name>
              <description>Last read data byte/word flag (when the I3C acts as controller)
</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FCF</name>
              <description>Frame complete flag (whatever the I3C acts as controller/target)
</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RxTGTENDF</name>
              <description>Target-initiated read end flag (when the I3C acts as controller)
</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERRF</name>
              <description>Flag (whatever the I3C acts as controller/target)
</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IBIF</name>
              <description>IBI flag (when the I3C acts as controller)
</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IBIENDF</name>
              <description>IBI end flag (when the I3C acts as target)
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CRF</name>
              <description>Controller-role request flag (when the I3C acts as controller)
</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CRUPDF</name>
              <description>Controller-role update flag (when the I3C acts as target)
</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HJF</name>
              <description>Hot-join flag (when the I3C acts as controller)
</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WKPF</name>
              <description>Wake-up/missed start flag (when the I3C acts as target)
</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GETF</name>
              <description>Get flag (when the I3C acts as target)
</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STAF</name>
              <description>Get status flag (when the I3C acts as target)
</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DAUPDF</name>
              <description>Dynamic address update flag (when the I3C acts as target)
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MWLUPDF</name>
              <description>Maximum write length update flag (when the I3C acts as target)
</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MRLUPDF</name>
              <description>Maximum read length update flag (when the I3C acts as target)
</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSTF</name>
              <description>Reset pattern flag (when the I3C acts as target)
</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ASUPDF</name>
              <description>Activity state update flag (when the I3C acts as target)
</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INTUPDF</name>
              <description>Interrupt/controller-role/hot-join update flag (when the I3C acts as target)
</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DEFF</name>
              <description>DEFTGTS flag (when the I3C acts as target)
</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GRPF</name>
              <description>Group addressing flag (when the I3C acts as target)
</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
